// 这个 case 用来测试被和谐的书籍, 没有评分, 没有评论等
const data = {
  title: '政治的逻辑',
  subtitle: '马克思主义政治原理',
  original_title: '',
  id: '27012117',
  isbn: '9787208140400',
  author: [
    '王沪宁',
    '林尚立',
    '孙关宏'
  ],
  translator: [],
  publish: '上海人民出版社',
  producer: '',
  publishDate: '2016-10',
  pages: '650',
  price: '98.00元',
  binding: '精装',
  series: '',
  book_intro: '《政治的逻辑》是高校社会科学尤其是政治学、行政学学科研究人士的重要参考书，是党政干部的首选学习马克思主义原理的必备参考书。《政治的逻辑》不仅仅是一本政治学著作，实际上也是一本研究马克思主义的理论著作。……从这个意义上讲，这本书的贡献是双重的。 作者王沪宁，复旦大学国际政治系国际政治专业毕业，研究生学历，法学硕士学位，教授，是现任中央政治局常委、中央书记处书记，中央政策研究室主任，中央全面深化改革领导小组办公室主任。',
  author_intro: '王沪宁，复旦大学政治学教授，主要研究方向：政治学、中国政治。代表作：《政治的逻辑——马克思主义政治学原理》（与人合著，上海人民出版社2004年版）。1955年10月6日生于上海，籍贯山东掖县。1977年2月毕业于华东师范大学外语系法国语言文学专业，后去上海社会科学院从事自然辩证法研究。1978年9月考取复旦大学国际政治系硕士研究生，1981年7月获法学硕士学位，同年留校任教。复旦大学国际政治系国际政治专业毕业，研究生学历，法学硕士学位，教授。 作者王沪宁是现任中央政治局常委、中央书记处书记，中央政策研究室主任，中央全面深化改革领导小组办公室主任。',
  catalog: [],
  original_texts: [
    '列宁有句名言：“马克思主义理论的绝对要求，就是要把问题提到一定的历史范围之内。”毛泽东同志也说过：研究历史要“弄清楚所研究的问题发生的一定的时间和一定的空间，把问题当作一定历史条件下的历史过程去研究”历史的观点也是我们研究国际政治的基本要求\nMarx创立科社理论寻求解放的道路，建立更优越的社会制度，因此在分析件时更多地侧重阶级层次。历史证明，科社理论推动了社会进步，唤醒了被剥削阶级和被压迫民族起来进行反对资本主义的革命。从20世纪初以来，这场革命在世界范围内取得了巨大的进展，在一些落后国家和地区无产阶级甚至夺取了国家政权。新的历史条件决定了短期内社会主义世界革命难以成功，新兴的无产阶级政权面临着发展经济、提高人民生活水平和现固国家政权的艰巨任务，国内的主要矛盾已不再是阶级斗争，而是发展落后的生产力，解决其与生产关系的矛盾。在相当长一个时期，社会主义国家必须与资本主义国家共处同生。 ',
    '阶级消亡首先必须消灭剥削阶级及其制度。但最终起决定作用的基本条件是生产力的高度发展。没有生产力的发展，不会有阶级的产生，也不会有阶级的消亡，这就是马克思主义关于阶级问题的基本结论。 '
  ],
  labels: [],
  cover_url: 'https://img2.doubanio.com/view/subject/l/public/s29602841.jpg',
  url: 'https://book.douban.com/subject/27012117/',
  rating: {
    count: 282,
    info: '',
    value: 8.6,
    five_star_pre: 57.4,
    four_star_pre: 28,
    three_star_pre: 9.6,
    two_star_pre: 2.1,
    one_star_pre: 2.8
  },
  comments: [],
  reviews: [],
  notes: []
};

module.exports = data;